/*
31:开关灯
查看 提交 统计 提问
总时间限制: 1000ms 内存限制: 65536kB
描述
假设有N盏灯(N为不大于5000的正整数)，从1到N按顺序依次编号，初始时全部处于开启状态；有M个人(M为不大于N的正整数)也从1到M依次编号。

第一个人（1号）将灯全部关闭，第二个人（2号）将编号为2的倍数的灯打开，第三个人（3号）将编号为3的倍数的灯做相反处理（即，将打开的灯关闭，将关闭的灯打开）。依照编号递增顺序，以后的人都和3号一样，将凡是自己编号倍数的灯做相反处理。

请问：当第M个人操作之后，哪几盏灯是关闭的，按从小到大输出其编号，其间用逗号间隔。

输入
输入正整数N和M，以单个空格隔开。
输出
顺次输出关闭的灯的编号，其间用逗号间隔。
样例输入
10 10
样例输出
1,4,9
*/

//#include <stdio.h>
//int main()
//{
//	_Bool a[5001]={0};
//	int i,j,n,m;
//	scanf("%d %d",&n,&m);
//	for(j=1;j<=n;j++){
//		a[j]=1;
//	}
//	for (i=1;i<=m;i++){
//		for (j=1;j<=n;j++){
//			if (j%i==0) a[j]=!a[j];
//		}
//	}
//	for(j=1;j<=n;j++){
//		if (!a[j]) {
//		printf("%d",j);
//		break;
//		}
//	}
//	for(j++;j<=n;j++){
//		if (!a[j]) printf(",%d",j);
//	}	
//	return 0;
//}

#include <stdio.h>
int main()
{
	_Bool a[5001]={0};
	int i,j,n,m;
	scanf("%d %d",&n,&m);
	for (i=1;i<=m;i++){
		for (j=1;j<=n;j++){
			if (j%i==0) a[j]=!a[j];
		}
	}
	for(j=1;j<=n;j++){
		if (a[j]) {
		printf("%d",j);
		break;
		}
	}
	for(j++;j<=n;j++){
		if (a[j]) printf(",%d",j);
	}	
	return 0;
}
